	// сколько звёзд может быть одновременно на экране
	var starsCount = 800;
	// на старте массив со звёздами будет пустой
	var stars = [];
	// класс, на основе которого будут сделаны все звёзды
	class Star{
		// конструктор, который вызывается при создании каждого объекта на основе этого класса
		constructor(){
			// у новой звезды будут случайные координаты
			this.x = random(-width, width);
			this.y = random(-height, height);
			// глубина — насколько виртуально близко к экрану появится звезда
			this.z = random(width);
		}
		// метод, который обновляет координаты звезды
		update(){
			// скорость полёта
			var speed = 8;
			// приближаем звезду к краю экрана, уменьшая глубину на значение скорости
			this.z -= speed;
			// если звезда вылетела за край экрана — делаем из неё новую звезду, для этого меняем координаты
			if(this.z < 1){
				this.x = random(-width, width);
				this.y = random(-height, height);
				// для новой звезды вместо старой глубину появления теперь выбираем не случайным образом, а задаём прямо
				this.z = width;
			}
		}

		// метод, который отрисовывает звезду на экране
		drawStar(){
			// каждая звезда — белого цвета
			fill(236);
			// и без контура
			noStroke();

			// с помощью функции map() из библиотеки p5.js получаем новые координаты для отрисовки звезды 
			var sx = map(this.x / this.z, 0, 1, 0, width);
			var sy = map(this.y / this.z, 0, 1, 0, height);

			// чем ближе к краю экрана (чем меньше глубина z) — тем больше радиус 
			var r = map(this.z, 0, width, 10, 0);
			// рисуем звезду в новых координатах и новым размером
			ellipse(sx, sy, r, r);
		}
	}

	// подготавливаем всё к запуску — то, что написано здесь выполнится автоматически сразу после загрузки
	function setup(){
		// создаём холст, на котором будем рисовать
		createCanvas(innerWidth, innerHeight);
		// размещаем сразу все звёзды на холсте
		for (var i = 0; i < starsCount; i++) {
			// каждая новая звезда — объект класса Star и умеет то же самое, что и все остальные звёзды
			stars[i] = new Star();
		}
	}

// пока мы не закроем страницу, постоянно будет выполняться функция drw() 
function draw(){
	// ставим чёрный фон и указываем скорость обновления фона — чем меньше второе число, тем больший шлейф будут оставлять звёзды
	background(12, 170);
	// формируем центр экрана, куда «полетим» сквозь звёзды
	translate(width/2, height/2);

	// отрисовываем каждый раз все звёзды и меняем их положение
	for (var i = 0; i < starsCount; i++) {
		stars[i].drawStar();
		stars[i].update();
	}
}

	// если поменяется размер окна браузера — сразу меняем размер холста
	addEventListener('resize', () => {
		resizeCanvas(innerWidth, innerHeight);
	})	